[
  {
    "id": 1,
    "name": "Wall Sit",
    "type": "strength",
    "muscle": "quadriceps",
    "difficulty": "beginner",
    "instructions": "Stand with your back against a wall. Slide down the wall until your knees are bent at a 90-degree angle. Hold this position for as long as possible."
  },
  {
    "id": 2,
    "name": "Push-Ups",
    "type": "strength",
    "muscle": "chest, shoulders, triceps",
    "difficulty": "beginner",
    "instructions": "Start in a plank position with your hands shoulder-width apart. Lower your body towards the ground until your chest nearly touches the floor. Push back up to the starting position."
  },
  {
    "id": 3,
    "name": "Squats",
    "type": "strength",
    "muscle": "quadriceps, glutes, hamstrings",
    "difficulty": "beginner",
    "instructions": "Stand with your feet shoulder-width apart and toes slightly pointed outward. Lower your body as if sitting back into a chair, keeping your back straight. Push back up to the starting position."
  },
  {
    "id": 4,
    "name": "Lunges",
    "type": "strength",
    "muscle": "quadriceps, glutes, hamstrings",
    "difficulty": "beginner",
    "instructions": "Stand with your feet hip-width apart. Step forward with one leg, bending both knees to 90 degrees. Push back up to the starting position and repeat with the other leg."
  },
  {
    "id": 5,
    "name": "Plank",
    "type": "strength",
    "muscle": "core",
    "difficulty": "beginner",
    "instructions": "Start in a push-up position, but rest on your forearms instead of your hands. Hold this position, keeping your body in a straight line from head to heels."
  },
  {
    "id": 6,
    "name": "Crunches",
    "type": "strength",
    "muscle": "abdominals",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your knees bent and feet flat on the floor. Place your hands behind your head and gently pull your upper body towards your knees."
  },
  {
    "id": 7,
    "name": "Leg Raises",
    "type": "strength",
    "muscle": "lower abdominals",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your legs extended straight up. Slowly lower your legs towards the ground, then raise them back to the starting position."
  },
  {
    "id": 8,
    "name": "Russian Twists",
    "type": "strength",
    "muscle": "obliques",
    "difficulty": "intermediate",
    "instructions": "Sit on the floor with your knees bent and feet flat. Lean back slightly and twist your torso from side to side."
  },
  {
    "id": 9,
    "name": "Bicycle Crunches",
    "type": "strength",
    "muscle": "obliques",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your knees bent and hands behind your head. Bring your right elbow towards your left knee, then alternate sides."
  },
  {
    "id": 10,
    "name": "Tricep Dips",
    "type": "strength",
    "muscle": "triceps",
    "difficulty": "beginner",
    "instructions": "Find a sturdy surface, such as a chair or bench. Place your hands on the surface behind you and lift your body off the ground. Lower your body towards the ground, then push back up to the starting position."
  },
  {
    "id": 11,
    "name": "Jumping Jacks",
    "type": "cardio",
    "muscle": "full body",
    "difficulty": "beginner",
    "instructions": "Stand with your feet together and arms at your sides. Jump up, spreading your legs and raising your arms overhead. Jump back to the starting position."
  },
  {
    "id": 12,
    "name": "High Knees",
    "type": "cardio",
    "muscle": "quadriceps, core",
    "difficulty": "beginner",
    "instructions": "Run in place, bringing your knees up towards your chest as high as possible."
  },
  {
    "id": 13,
    "name": "Butt Kicks",
    "type": "cardio",
    "muscle": "hamstrings, glutes",
    "difficulty": "beginner",
    "instructions": "Run in place, kicking your heels towards your glutes."
  },
  {
    "id": 14,
    "name": "Mountain Climbers",
    "type": "cardio",
    "muscle": "core, shoulders, quads",
    "difficulty": "intermediate",
    "instructions": "Start in a push-up position. Bring your right knee towards your chest, then your left knee. Continue alternating quickly."
  },
  {
    "id": 15,
    "name": "Burpees",
    "type": "cardio",
    "muscle": "full body",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet shoulder-width apart. Squat down and place your hands on the floor. Kick your feet back into a push-up position. Do a push-up. Jump your feet back up to your hands. Stand up and jump."
  },
  {
    "id": 16,
    "name": "Plank Jacks",
    "type": "cardio",
    "muscle": "core, shoulders, triceps",
    "difficulty": "intermediate",
    "instructions": "Start in a plank position. Jump your feet out to the sides, then back together. Continue this movement quickly."
  },
  {
    "id": 17,
    "name": "Burpee Broad Jumps",
    "type": "cardio",
    "muscle": "full body",
    "difficulty": "intermediate",
    "instructions": "Perform a burpee, but instead of standing up, jump as high as you can."
  },
  {
    "id": 18,
    "name": "High Knees with Arm Raises",
    "type": "cardio",
    "muscle": "quadriceps, core, arms",
    "difficulty": "beginner",
    "instructions": "Run in place, bringing your knees up towards your chest as high as possible. Simultaneously raise your arms overhead."
  },
  {
    "id": 19,
    "name": "Jumping Lunges",
    "type": "cardio",
    "muscle": "quadriceps, glutes, hamstrings",
    "difficulty": "intermediate",
    "instructions": "Perform a lunge, then jump and switch legs in the air, landing in a lunge position with the opposite leg forward."
  },
  {
    "id": 20,
    "name": "Jumping Rope",
    "type": "cardio",
    "muscle": "quadriceps, glutes, hamstrings",
    "difficulty": "beginner",
    "description": "Jump over a rotating rope, adjusting the speed as needed."
  },
  {
    "id": 21,
    "name": "Cat-Cow Stretch",
    "type": "flexibility",
    "muscle": "Spine, Abdomen, Neck",
    "difficulty": "beginner",
    "description": "Start on your hands and knees, wrists under shoulders, knees under hips. Inhale, drop your belly towards the floor, lift your chin and chest, gazing up. Exhale, round your spine towards the ceiling, drawing your belly in and tucking your chin to your chest. Repeat 5-10 times."
  },
  {
    "id": 22,
    "name": "Hamstring Stretch",
    "type": "flexibility",
    "muscle": "Hamstrings",
    "difficulty": "beginner",
    "description": "Sit or lie on the floor with one leg extended straight out. Reach towards your toes, keeping your back straight. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 23,
    "name": "Quadriceps Stretch",
    "type": "flexibility",
    "muscle": "Quadriceps",
    "difficulty": "beginner",
    "description": "Stand upright. Grasp one foot behind you and gently pull it towards your buttocks. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 24,
    "name": "Calf Stretch",
    "type": "flexibility",
    "muscle": "Calves",
    "difficulty": "beginner",
    "description": "Stand facing a wall, placing your hands on the wall for support. Step one leg back and keep the heel of that foot on the ground. Lean forward until you feel a stretch in the calf of the back leg. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 25,
    "name": "Piriformis Stretch",
    "type": "flexibility",
    "muscle": "Piriformis",
    "difficulty": "intermediate",
    "description": "Lie on your back with both knees bent. Cross one ankle over the opposite knee. Gently pull the knee towards your chest. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 26,
    "name": "Hip Flexor Stretch",
    "type": "flexibility",
    "muscle": "Hip Flexors",
    "difficulty": "intermediate",
    "description": "Kneel on one knee with the other leg bent at 90 degrees. Gently push your hips forward until you feel a stretch in the front of your hip. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 27,
    "name": "Spinal Twist",
    "type": "flexibility",
    "muscle": "Spine, Obliques",
    "difficulty": "intermediate",
    "description": "Sit or lie on the floor with your legs extended. Gently twist your torso to one side, reaching your arm towards the opposite leg. Hold for 30 seconds and repeat on the other side."
  },
  {
    "id": 28,
    "name": "Straddle Stretch",
    "type": "flexibility",
    "muscle": "Inner thighs, Groin",
    "difficulty": "intermediate",
    "description": "Sit on the floor with your legs spread wide apart. Gently lean forward from your hips, reaching towards your feet. Hold for 30 seconds."
  },
  {
    "id": 29,
    "name": "Pigeon Pose",
    "type": "flexibility",
    "muscle": "Hips, Glutes",
    "difficulty": "advanced",
    "description": "Start on your hands and knees. Bring one knee forward and place it in front of your wrist, pointing the other leg straight back. Gently lower your hips towards the floor. Hold for 30 seconds and repeat with the other leg."
  },
  {
    "id": 30,
    "name": "Shoulder Rolls",
    "type": "flexibility",
    "muscle": "Shoulders, Upper Back",
    "difficulty": "beginner",
    "description": "Slowly roll your shoulders backwards in a circular motion. Then reverse the direction and roll them forwards. Repeat 10 times in each direction."
  },
  {
    "id": 31,
    "name": "Single-Leg Stand",
    "type": "balance",
    "muscle": "core, legs",
    "difficulty": "beginner",
    "instructions": "Stand on one leg with the other leg lifted slightly off the ground. Hold this position for 20-30 seconds, then switch legs. Focus on keeping your body upright and stable."
  },
  {
    "id": 32,
    "name": "Heel-to-Toe Walk",
    "type": "balance",
    "muscle": "core, legs",
    "difficulty": "beginner",
    "instructions": "Walk in a straight line by placing the heel of one foot directly in front of the toes of the other foot. Keep your arms out for balance and try not to wobble."
  },
  {
    "id": 33,
    "name": "Standing March",
    "type": "balance",
    "muscle": "core, legs",
    "difficulty": "beginner",
    "instructions": "Lift one knee towards your chest while standing on the opposite leg. Alternate legs in a marching motion, trying to maintain balance on each leg."
  },
  {
    "id": 34,
    "name": "Glute Bridge",
    "type": "strength, balance",
    "muscle": "glutes, core",
    "difficulty": "beginner",
    "instructions": "Lie on your back with knees bent and feet flat on the floor. Lift your hips off the ground, squeezing your glutes. Hold for a moment before lowering back down."
  },
  {
    "id": 35,
    "name": "Side Leg Raises",
    "type": "balance, strength",
    "muscle": "hips, core",
    "difficulty": "beginner",
    "instructions": "Lie on your side with your legs straight. Lift the top leg as high as possible, then lower it back down. Repeat on the other side."
  },
  {
    "id": 36,
    "name": "Tree Pose",
    "type": "balance, flexibility",
    "muscle": "core, legs",
    "difficulty": "intermediate",
    "instructions": "Stand tall and place one foot on the inner thigh or calf of the opposite leg (avoid the knee). Bring your palms together in front of your chest or stretch them overhead, holding for 30 seconds."
  },
  {
    "id": 37,
    "name": "Warrior III",
    "type": "balance, strength",
    "muscle": "core, legs",
    "difficulty": "intermediate",
    "instructions": "From a standing position, lean forward and lift one leg behind you, keeping it straight and your torso parallel to the floor. Hold for a few seconds before returning to the starting position."
  },
  {
    "id": 38,
    "name": "Single-Leg Deadlift",
    "type": "balance, strength",
    "muscle": "hamstrings, core",
    "difficulty": "intermediate",
    "instructions": "Stand on one leg with a slight bend in the knee. Hinge forward at the hips, keeping your back straight, and extend the other leg behind you. Return to standing position and repeat."
  },
  {
    "id": 39,
    "name": "Bosu Ball Squat",
    "type": "balance, strength",
    "muscle": "legs, core",
    "difficulty": "intermediate",
    "instructions": "Stand on a Bosu ball with your feet shoulder-width apart. Perform a squat, keeping your chest up and knees behind your toes. Engage your core for stability."
  },
  {
    "id": 40,
    "name": "Lateral Leg Raises",
    "type": "balance, strength",
    "muscle": "hips, core",
    "difficulty": "intermediate",
    "instructions": "Stand with feet hip-width apart. Slowly lift one leg to the side, keeping it straight. Return to the starting position and repeat with the other leg."
  },
  {
    "id": 41,
    "name": "The Hundred",
    "type": "Pilates",
    "muscle": "core, arms",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your knees bent and feet flat on the floor. Lift your head, neck, and shoulders off the mat and extend your arms by your sides. Pump your arms up and down while keeping your core engaged and breathing deeply for 100 counts."
  },
  {
    "id": 42,
    "name": "Pelvic Curl",
    "type": "Pilates",
    "muscle": "glutes, core",
    "difficulty": "beginner",
    "instructions": "Lie on your back with knees bent and feet flat on the floor. Inhale to prepare, then exhale as you lift your hips off the floor, squeezing your glutes. Hold at the top, then slowly roll back down vertebra by vertebra."
  },
  {
    "id": 43,
    "name": "Leg Circles",
    "type": "Pilates",
    "muscle": "hips, core",
    "difficulty": "beginner",
    "instructions": "Lie on your back with one leg extended toward the ceiling. Slowly circle your leg clockwise for 10 repetitions, then switch to counterclockwise. Keep your core engaged and avoid arching your back."
  },
  {
    "id": 44,
    "name": "Single Leg Stretch",
    "type": "Pilates",
    "muscle": "core, legs",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your knees bent and hands on your shins. Lift your head, neck, and shoulders off the mat as you extend one leg out while pulling the opposite knee towards your chest. Switch legs in a controlled motion, keeping your core engaged."
  },
  {
    "id": 45,
    "name": "Rolling Like a Ball",
    "type": "Pilates",
    "muscle": "core, spine",
    "difficulty": "beginner",
    "instructions": "Sit on the floor with your knees bent and feet off the floor. Hold your shins and curl your spine into a ball. Roll back onto your shoulder blades, then return to the starting position, using your core to control the movement."
  },
  {
    "id": 46,
    "name": "Double Leg Stretch",
    "type": "Pilates",
    "muscle": "core",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your knees bent and hands on your shins. Lift your head, neck, and shoulders off the mat. Extend both legs straight out as you reach your arms overhead, then return to the starting position with control."
  },
  {
    "id": 47,
    "name": "Saw",
    "type": "Pilates",
    "muscle": "core, hamstrings",
    "difficulty": "intermediate",
    "instructions": "Sit tall with your legs extended and feet flexed. Extend your arms out to the sides. Rotate your torso to one side and reach your pinky finger toward the opposite foot. Return to center and repeat on the other side."
  },
  {
    "id": 48,
    "name": "Teaser",
    "type": "Pilates",
    "muscle": "core, legs",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your arms extended overhead and legs straight. Lift your upper body and legs at the same time, balancing on your sit bones. Hold for a few seconds, then slowly lower back down with control."
  },
  {
    "id": 49,
    "name": "Spine Stretch Forward",
    "type": "Pilates",
    "muscle": "spine, hamstrings",
    "difficulty": "intermediate",
    "instructions": "Sit with your legs extended wider than hip-width apart. Inhale to lengthen your spine, then exhale as you reach forward, keeping your back straight. Hold for a moment, then return to the starting position."
  },
  {
    "id": 50,
    "name": "Corkscrew",
    "type": "Pilates",
    "muscle": "core, obliques",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your legs extended straight up toward the ceiling. Keep your arms by your sides. Slowly lower your legs to one side, making a circle, then return to the center and repeat on the other side."
  }
]